Repository: harrydemo/androidsourcecodes
Catalog: Android SMSPopup速读短信源码/SMSPopup/SMSPopup/*.po
Languages: it

# pref_led_pattern_entries_fast
source: Fast
it: Veloce

# pref_led_pattern_entries_normal
source: Normal
it: Normale

# pref_led_pattern_entries_slow
source: Slow
it: Lento
