Repository: harrydemo/androidsourcecodes
Catalog: Android SMSPopup速读短信源码/SMSPopup/SMSPopup/*.po
Languages: it

# new_text_at
source: New message at %s
it: Nuovo messaggio ricevuto alle %s

# unread_text_waiting
source: %d other unread message(s)
it: %d msg non letto(i)

# mms_subject
source: Subject:
it: Oggetto:

# notification_multiple_title
source: New messages
it: Nuovo messaggio

# notification_multiple_text
source: %d unread messages.
it: %d ulteriori messaggi non letti.

# notification_scroll_privacy
source: New message from: %s
it: Nuovo messaggio da: %s

# button_close
source: Close
it: Chiudi

# button_reply
source: Reply
it: Rispondi

# button_view
source: View
it: Leggi

# button_view_mms
source: View MMS
it: Leggi MMS

# button_delete
source: Delete
it: Elimina

# button_next
source: Next
it: Successivo

# button_previous
source: Previous
it: Precedente

# button_unlock
source: Unlock
it: Sblocca

# button_speak
source: Speak
it: Parla

# button_delete_noconfirm
source: Delete (no confirmation)
it: Elimina (senza conferma)

# button_quickreply
source: Quick Reply
it: Risposta rapida

# button_disabled
source: Disabled
it: Disabilita

# pref_config_title
source: SMS Popup Configuration
it: Configurazione SMS Popup

# pref_other_title
source: Other
it: Altro

# pref_enabled_title
source: Enable SMS Popup
it: Abilita SMS Popup

# pref_enabled_summaryon
source: SMS Popup is enabled
it: SMS Popup è attivo

# pref_enabled_summaryoff
source: SMS Popup is disabled
it: SMS Popup è disattivo

# pref_about_title
source: About
it: Info

# pref_about_summary
source: About SMS Popup
it: Informazioni su SMS Popup

# pref_about_text
source: Created by: Adam K Email: adam@everythingandroid.net Blog: http://www.everythingandroid.net SMS Popup is a simple application that shows a dialog when an SMS is received - turning on the screen and unlocking the keyguard if needed. It shows the most recent message, who it's from and the contact picture if available. Feel free to email me any comments, suggestions or bugs. German translation by: Feyyaz A. Email: f_alingan@hotmail.com Website: http://www.yenio.com Dutch translation by: mellie@xs4all.nl Spanish translation by: Diego Fernández Email: profediego@gmail.com Russian translation by: Artem Kavalerov Email: artem.kavalerov@gmail.com Credits to Min Tran for the app icon. (http://min.frexy.com)
it: Creato da: Adam K Email: adam@everythingandroid.net Blog: http://www.everythingandroid.net SMS Popup è una semplice applicazione che mostra una finestra di dialogo quando si riceve un SMS - Attivando lo schermo e sbloccando la tastiera se necessario. Mostra il più recente messaggio, il mittente e una foto del contatto se disponibile. Mandami una e-mail con commenti, suggerimenti o bugs. Traduzione in tedesco di: Feyyaz A. Email: f_alingan@hotmail.com Sito web: http://www.yenio.com Traduzione in olandese di: mellie@xs4all.nl Traduzione in spagnolo di: Diego Fernández Email: profediego@gmail.com Traduzione in russo di: Artem Kavalerov Email: artem.kavalerov@gmail.com Traduzione in italiano di: Giuseppe Ferro Email: peppens1@gmail.com Sito web: http://www.peppens1.eu Traduzione in italiano di: Diego Pierotto Crediti a Min Tran per l'icona. (http://min.frexy.com)

# pref_faq_summary
source: Frequently Asked Questions
it: Domande frequenti

# pref_releasenotes_title
source: What's New?
it: Novità

# pref_releasenotes_summary
source: See what's new in this version
it: Mostra le novità di questa versione

# pref_sendemail_title
source: E-mail the Developer
it: Scrivi email allo sviluppatore

# pref_sendemail_summary
source: E-mail comments or bugs to the developer
it: E-mail di commenti o bugs allo sviluppatore

# pref_sendemail_dialog
source: Can I include your system information in the e-mail (this will help me troubleshoot bugs easier)?
it: Posso allegare le tue informazioni di sistema nella email (questo mi aiuterà a risolvere i bugs più facilmente)?

# pref_sendemail_buttonok
source: Sure
it: Certo!

# pref_sendemail_buttoncancel
source: No way
it: No

# pref_additional_title
source: Additional Settings
it: Impostazioni avanzate

# pref_additional_summary
source: Additional SMS Popup configuration
it: Impostazioni aggiuntive SMS Popup

# pref_timeout_title
source: Screen Timeout
it: Spegnimento schermo

# pref_timeout_summary
source: The screen will sleep after this time
it: Lo schermo si spegnerà dopo un certo tempo

# pref_dimscreen_title
source: Dim Popup Screen
it: Dim Finestra Popup

# pref_dimscreen_summaryon
source: Popup screen will be dim (saves battery)
it: La finestra Popup sarà a schermo spento (risparmia batteria)

# pref_dimscreen_summaryoff
source: Popup screen will be bright
it: La finestra Popup illuminerà il display

# pref_privacy_title
source: Privacy Mode
it: Modalità Privacy

# pref_privacy_summaryon
source: Contents of the message will only be shown after unlock
it: Il contenuto del msg verrà visualizzato solo dopo lo sblocco display

# pref_privacy_summaryoff
source: Contents of the message will be shown immediately
it: Il contenuto del msg verrà visualizzato subito

# pref_markread_title
source: Mark Read
it: Segna come Letto

# pref_markread_summaryon
source: Messages will be marked as read when clicking "Close"
it: Il msg verrà segnato come letto premendo "Chiudi"

# pref_markread_summaryoff
source: Messages will not be marked as read when clicking "Close"
it: Il msg non verrà segnato come letto premendo "Chiudi"

# pref_onlyShowOnKeyguard_title
source: Restrict Popup
it: Popup ristretto

# pref_onlyShowOnKeyguard_summaryon
source: Popup window will only show when keyguard is engaged
it: La finestra popup verrà mostrata solo quando si scrive

# pref_onlyShowOnKeyguard_summaryoff
source: Popup will always show
it: La finestra Popup verrà mostrata sempre

# pref_require_unlock_title
source: Require Screen Unlock
it: Richiedi sblocco schermo

# pref_require_unlock_summaryon
source: Buttons will be hidden till screen is unlocked
it: I pulsanti sarannò nascosti finchè lo schermo non sarà sbloccato

# pref_require_unlock_summaryoff
source: Buttons will show immediately
it: I pulsanti saranno mostrati da subito

# pref_inbox_app_title
source: Choose Inbox App
it: Scegli l'applicazione Inbox

# pref_inbox_app_summary
source: Choose the application that is launched for multiple messages
it: Scegli l'applicazione che sarà lanciata per msg multipli

# pref_inbox_app_info
source: Note that the Reply messaging application is set by the system
it: Ricorda che l'applicazione di Risposta è settata dal sistema

# pref_show_buttons_title
source: Show Buttons On Popup
it: Mostra tasti nel Popup

# pref_show_buttons_summaryon
source: Buttons on popup are visible
it: I tasti nel popup sono visibili

# pref_show_buttons_summaryoff
source: Buttons are hidden in long press menu
it: I tasti sono nascosti se premi a lungo nel menu

# pref_show_delete_button_title
source: Show a Delete Button
it: Mostra il pulsante Elimina

# pref_show_delete_button_summaryon
source: Delete button is enabled
it: Il pulsante Elimina è abilitato

# pref_show_delete_button_summaryoff
source: Delete button is disabled
it: Il pulsante Elimina è disabilitato

# pref_show_delete_button_dialog_title
source: Delete Message
it: Elimina Messaggio

# pref_show_delete_button_dialog_text
source: Are you sure?
it: Sei sicuro?

# pref_blur_title
source: Blur Background
it: Effetto sfondo Blur

# pref_blur_summaryon
source: The background behind the message window will be blurred out
it: Lo sfondo dietro il Popup verrà sfumato

# pref_blur_summaryoff
source: The background behind the message window will not be blurred
it: Lo sfondo dietro il Popup non verrà sfumato

# pref_notif_title
source: Notifications
it: Notifiche

# pref_notif_summary
source: Notification configuration
it: Configurazione notifiche

# pref_notif_category_title
source: Notification Configuration
it: Configurazione Notifiche

# pref_vibrate_category_title
source: Vibrate Configuration
it: Configurazione vibrazione

# pref_flashled_category_title
source: LED Configuration
it: Configurazione LED di stato

# pref_reminder_category_title
source: Reminder Configuration
it: Configurazione promemoria

# pref_notif_enabled_title
source: Enable Notifications
it: Abilita Notifiche

# pref_notif_enabled_summaryon
source: Notifications are enabled
it: Le notifiche sono abilitate

# pref_notif_enabled_summaryoff
source: Notifications are disabled
it: Le notifiche sono disabilitate

# pref_notif_enabled_warning
source: To avoid conflicts and multiple alerts, please disable the system SMS notifications and any other apps that provide a notification when a SMS is received. To turn off the system notification, go to the messaging app, hit menu -&gt; settings and un-check notifications.
it: Per evitare conflitti e notifiche multiple, si consiglia di disattivare le notifiche SMS integrate al sistema e le eventuali altre applicazioni che forniscono una notifica quando viene ricevuto un SMS. Per disattivare le notifiche di sistema, vai in Messaggi, premi menu -&gt; Impostazioni, e togli la spunta su Notifiche.

# pref_popup_enabled_title
source: Show a Popup
it: Mostra un popup

# pref_popup_enabled_summaryon
source: Message will open in a popup
it: Il msg verrà aperto in un popup

# pref_popup_enabled_summaryoff
source: Message will only show in notification area (if enabled)
it: Il msg verrà mostrato solo nell'area notifiche (se abilitata)

# pref_notif_test_title
source: Test Notification
it: Prova le Notifiche

# pref_notif_test_summary
source: Test out your notification
it: Prova le impostazioni di notifica effettuate

# pref_notif_test_message
source: Testing your notification now!
it: Prova notifica in corso!

# pref_notif_sound_title
source: Notification Sound
it: Suono Notifica

# pref_notif_sound_summary
source: This sound will play when a message is received
it: Questo suono verrà eseguito alla ricezione di un msg.

# pref_vibrate_title
source: Vibrate
it: Vibrazione

# pref_vibrate_summaryon
source: Vibrate is on
it: La vibrazione è abilitata

# pref_vibrate_summaryoff
source: Vibrate is off
it: La vibrazione è disabilitata

# pref_vibrate_pattern_title
source: Vibrate Pattern
it: Tipologia Vibrazione

# pref_vibrate_pattern_summary
source: Set the vibration pattern
it: Imposta l'intervallo di vibrazione

# pref_vibrate_pattern_ok
source: Custom vibrate pattern set
it: Imposta un intervallo personalizzato

# pref_vibrate_pattern_bad
source: Custom vibrate pattern invalid
it: Intervallo personalizzato non valido, usa quello predefinito

# pref_vibrate_pattern_help
source: Enter a custom vibrate pattern, in the format: millisOff, millisOn, etc. For example: 0,1000 0,500,200,500,200,500
it: Inserisci un valore personalizzato, nel formato: millisOff, millisOn, etc. Per esempio: 0,1000 0,500,200,500,200,500

# pref_custom_val
source: custom
it: personalizza

# pref_flashled_title
source: Blink LED
it: Stato LED

# pref_flashled_summaryon
source: Blink LED when a message is received
it: Accendi il LED alla ricezione di un msg

# pref_flashled_summaryoff
source: Do not blink LED when a message is received
it: Non accendere il LED alla ricezione di un msg

# pref_flashled_color_title
source: LED Color
it: Colore LED

# pref_flashled_color_summary
source: The color of the LED
it: Il colore del LED

# pref_flashled_color_custom_dialog_red
source: Red:
it: Rosso:

# pref_flashled_color_custom_dialog_green
source: Green:
it: Verde:

# pref_flashled_color_custom_dialog_blue
source: Blue:
it: Blu:

# pref_flashled_color_custom_dialog_preview
source: Preview:
it: Anteprima:

# pref_flashled_color_custom_set
source: Custom LED color set
it: Colore Led personalizzato

# pref_flashled_pattern_title
source: LED Blink Rate
it: Velocità lampeggio LED

# pref_flashled_pattern_summary
source: Set the speed the LED blinks
it: Imposta la frequenza di lampeggio del LED

# pref_flashled_pattern_ok
source: Custom LED blink rate set
it: Imposta un valore personalizzato

# pref_flashled_pattern_bad
source: Custom LED blink rate is invalid
it: Valore personalizzato non valido, usa quello predefinito

# pref_flashled_pattern_help
source: Enter the time in milliseconds to turn the LED on and off
it: Inserisci un valore in millisecondi per accendere e spegnere il LED

# pref_flashled_pattern_help_on
source: Time on:
it: Tempo attivo:

# pref_flashled_pattern_help_off
source: Time off:
it: Tempo disattivo:

# pref_notif_repeat_title
source: Enable Reminders
it: Abilita promemoria

# pref_notif_repeat_summaryon
source: Unread message reminders are enabled
it: Il promemoria messaggi non letti è abilitato

# pref_notif_repeat_summaryoff
source: Unread message reminders are disabled
it: Il promemoria messaggi non letti è disabilitato

# pref_notif_repeat_interval_title
source: Reminder Interval
it: Intervallo promemoria

# pref_notif_repeat_interval_summary
source: The time period between notification reminders
it: L'intervallo tra una notifica del promemoria e l'altra

# pref_notif_repeat_interval_dialogTitle
source: Interval (minutes)
it: Intervalllo in (minuti)

# pref_notif_repeat_times_title
source: Number of Reminders
it: Numero di promemoria

# pref_notif_repeat_times_summary
source: The number of reminder notifications to play
it: Il numero di promemoria da eseguire

# pref_notif_repeat_screen_on_title
source: Screen On for Reminders
it: Accendi schermo per ogni promemoria

# pref_notif_repeat_screen_on_summaryon
source: Reminders will turn screen on again
it: Il promemoria accenderà lo schermo

# pref_notif_repeat_screen_on_summaryoff
source: Reminders will not turn screen on
it: Il promemoria non accenderà lo schermo

# pref_notif_repeat_screen_on_warning
source: Warning - turning the screen on for reminders can significantly affect battery life
it: Attenzione - Accendere lo schermo per i promemoria, influisce in modo significativo sulla durata della batteria

# pref_notif_default_title
source: Default Notifications
it: Notifiche Generiche

# pref_notif_default_summary
source: Notifications for all contacts without an individual customization
it: Notifiche generali per tutti i contatti senza personalizzazione individuale

# pref_contacts_title
source: Contacts Notifications
it: Notifiche Contatti

# pref_contacts_summary
source: Individual contact customization
it: Notifiche individuali per ogni contatto

# pref_notif_help_title
source: Help - I'm confused!
it: Aiuto - Sono confuso!

# pref_notif_help_summary
source: Notifications Help
it: Aiuto notifiche

# pref_notif_help_message
source: SMS Popup now offers the ability to customize notifications on a per contact basis. When a new message comes in, SMS Popup will first check if the contact has a customized notification. If so, those settings are used, otherwise the default notifications are used. Using this functionality, you could set things up so only a few contacts show a popup while the rest trigger a regular notification. You could also ignore certain contacts by setting their notification to silent.
it: SMS Popup ora offre la possibilità di personalizzare le notifiche per ogni singolo contatto. Quando arriva un messaggio, SMS Popup verificherà prima se il contatto ha una notifica personalizzata. In caso affermativo, queste personalizzazioni verranno usate, in caso contrario verranno usate le notifiche standard. Usando le notifiche personalizzate, potresti impostare di mostrare il popup solo per alcuni contatti e per i rimanenti una notifica standard. Potresti anche ignorare alcuni contatti disattivando le loro notifiche.

# contact_customization_add
source: Add Custom Notifications
it: Aggiungi una notifica personalizzata

# contact_customization_edit
source: Edit Custom Notification
it: Modifica una notifica personalizzata

# contact_customization_remove
source: Remove Custom Notification
it: Elimina notifica personalizzata

# contact_customization_removed_toast
source: Custom Notification Removed
it: Notifica personalizzata eliminata

# contact_customization_save
source: Save
it: Salva

# contact_customization_title
source: Notifications for %s
it: Notifiche per %s

# contact_customization_enabled
source: Notifications are enabled for %s
it: Notifiche abilitate per %s

# contact_customization_disabled
source: Notifications are disabled for %s
it: Notifiche disabilitate per %s

# contact_customization_add_hint
source: Add/Edit contact notifications...
it: Aggiungi/Modifica notifiche contatto...

# ringtone_silent
source: Silent
it: Silenzioso

# pref_message_presets_title
source: Preset Messages
it: Messaggi standard

# pref_message_presets_summary
source: Configure preset messages for quick replies
it: Configura messaggi standard per risposte rapide

# message_presets_add
source: Add Preset Message
it: Aggiungi messaggio standard

# message_presets_edit
source: Edit Preset Message
it: Modifica messaggio standard

# message_presets_add_text
source: Create
it: Crea

# message_presets_save_text
source: Save
it: Salva

# message_presets_delete_text
source: Remove
it: Elimina

# message_presets_edit_text
source: Edit
it: Modifica

# message_presets_reorder_text
source: Move to top
it: Sposta in cima

# message_presets_empty_text
source: No presets defined
it: Nessun msg standard definito

# message_presets_add_toast
source: Message preset added
it: Messaggio standard aggiunto

# message_presets_save_toast
source: Message preset updated
it: Messaggio standard aggiornato

# message_presets_delete_toast
source: Message preset deleted
it: Messaggio standard eliminato

# message_presets_reorder_toast
source: Message preset moved to top
it: Messaggio standard spostato in cima

# message_presets_error_toast
source: Error - please try again
it: Errore, prova di nuovo

# message_counter
source: %d chars remaining
it: %d caratteri rimanenti

# message_counter_multiple
source: %d chars remaining, %d messages
it: %d caratteri rimanenti, %d messagggi

# quickreply_title
source: Quick Reply
it: Risposta rapida

# quickreply_from_text
source: To: %s
it: A: %s

# quickreply_preset_button
source: Presets
it: Msg standard

# quickreply_send_button
source: Send
it: Invia

# quickreply_sending_toast
source: Sending message...
it: Invio messaggio...

# quickreply_nomessage_toast
source: Send
it: Invia

# loading_message
source: Loading...
it: Caricamento...

# error_message
source: Error
it: Errore

# error_no_voice_recognition
source: Voice recognition not available on this device
it: Riconoscimento vocale non disponibile su questo dispositivo

# pref_button_config_title
source: Button Configuration
it: Configurazione tasti

# pref_button_config_summary
source: Popup button configuration
it: Configurazione dei tasti del popup

# pref_button_summary
source: Current Setting: %s
it: Impostazione corrente: %s

# pref_button1_title
source: Button 1 Configuration
it: Configurazione 1. tasto

# pref_button2_title
source: Button 2 Configuration
it: Configurazione 2. tasto

# pref_button3_title
source: Button 3 Configuration
it: Configurazione 3. tasto

# pref_donate_title
source: Donate to SMS Popup
it: Dona a Sms Popup

# pref_donate_text
source: SMS Popup is a free application that I work on in my spare time. If you find it useful, and can spare a few bucks, a donation would be much appreciated. Thanks!
it: SMS Popup è un'applicazione gratuita che sviluppo nel mio tempo libero. Se tu la trovi utile, e puoi risparmiare un pò di soldi, una donazione sarebbe molto apprezzata. Grazie!

# pref_donate_market_button
source: Donate via Android Market
it: Dona tramite Android Market

# pref_donate_paypal_button
source: Donate via PayPal
it: Dona tramite PayPal

source: View Contact
it: Mostra Contatto

# pref_quickreply_title
source: Quick Reply
it: Risposta rapida

# pref_quickreply_summaryon
source: Quick Reply is enabled
it: La risposta rapida è abilitata

# pref_quickreply_summaryoff
source: Quick Reply is disabled
it: La risposta rapida è disabilitata

# pref_quickreply_bothreplybuttons
source: Both reply buttons are already active, to configure them please go to the Button Configuration screen
it: Entrambi i tasti di risposta sono abilitati, per configurarli, vai nella schermata di configurazione tasti.

# pref_quickreply_noreplybuttons
source: No reply buttons are currently active, to configure them please go to the Button Configuration screen
it: I tasti di risposta non sono abilitati, per configurarli vai nella schermata di configurazione tasti

# button_replybyaddress
source: Reply (to phone number)
it: Rispondi (al n° telefono)

# pref_notif_signature_title
source: Quick Reply Signature
it: Firma risposta rapida

# pref_notif_signature_summary
source: Appears at the end of every quick reply
it: Mostrata alla fine di ogni risposta rapida

# eula_title
source: SMS Popup License Agreement
it: Contratto di licenza SMS Popup

# eula_accept
source: Accept
it: Accetto

# eula_refuse
source: Uninstall
it: Disinstalla

# pref_delivery_report_title
source: Delivery Reports
it: Avviso di consegna

# pref_delivery_report_summary
source: Request a delivery report for each message you send via quick reply
it: Richiedi un avviso di consegna per ogni messaggio inviato tramite la risposta rapida

# pref_split_message_title
source: Split Long Messages
it: Dividi messaggi lunghi

# pref_split_message_summaryon
source: Long messages will be split up (only needed for some CDMA carriers)
it: I messaggi lunghi saranno divisi (necessario solo per certi operatori CDMA)

# pref_split_message_summaryoff
source: Long messages will not be split up (only needed for some CDMA carriers)
it: I messaggi lunghi non saranno divisi (necessario solo per certi operatori CDMA)

# pref_autorotate_title
source: Autorotate Always On
it: Ruota sempre in automatico

# pref_autorotate_summaryon
source: Popup will always autorotate
it: Il popup ruoterà sempre in automatico

# pref_autorotate_summaryoff
source: Popup will auto-rotate based on the screen behind it
it: Il popup ruoterà in automatico in base allo schermo sottostante

# pref_screen_on_title
source: Screen On for Popup
it: Accendi schermo per i Popup

# pref_screen_on_summaryon
source: Screen will turn on when popup shows
it: Lo schermo si accenderà quando si mostra un popup

# pref_screen_on_summaryoff
source: Screen will not turn on when popup shows
it: Lo schermo non si accenderà quando si mostra un popup

# pref_screen_category
source: Screen Control
it: Controllo schermo

# quickreply_sent_toast
source: Message Sent
it: Messaggio inviato

# quickreply_failed_send_later
source: Currently unable to send your message. It will be sent when the service becomes available.
it: Impossibile inviare il messaggio ora. Sarà rispedito quando il servizio tornerà disponibile.

# quickreply_failed
source: Message failed to send
it: Invio messaggio fallito

# pref_custom
source: Custom
it: Personalizzato

# pref_notif_repeat_times_entries_keep_repeting
source: Keep repeating
it: Mantieni ripetizione

# pref_timeout_entries_10s
source: 10 seconds
it: 10 secondi

# pref_timeout_entries_20s
source: 20 seconds
it: 20 secondi

# pref_timeout_entries_30s
source: 30 seconds
it: 30 secondi

# pref_timeout_entries_1m
source: 1 minute
it: 1 minuto

# pref_timeout_entries_2m
source: 2 minutes
it: 2 minuti

# pref_timeout_entries_5m
source: 5 minutes
it: 5 minuti

# pref_timeout_entries_10m
source: 10 minutes
it: 10 minuti

# pref_vibrate_pattern_entries_normal
source: Normal
it: Normale

# pref_vibrate_pattern_entries_long
source: Long Vibrate
it: Vibrazione lunga

# pref_vibrate_pattern_entries_multiple_short
source: Multiple Short
it: Multiple brevi

# pref_vibrate_pattern_entries_multiple_long
source: Multiple Long
it: Multiple lunghe

# pref_led_color_blue
source: Blue
it: Blu

# pref_led_color_green
source: Green
it: Verde

# pref_led_color_red
source: Red
it: Rosso

# pref_led_color_yellow
source: Yellow
it: Giallo

# pref_led_color_cyan
source: Cyan
it: Ciano
