package com.example.metroline;

import java.util.ArrayList;
import java.util.List;

public class Data {
	public static String [] lineName = {"1号线","2号线","3号线","4号线内圈","4号线外圈","5号线","6号线","7号线","8号线","9号线","10号主线","10号支线","11号主线","11号支线"};
	
	public static String [] line1 = {"富锦路","友谊西路","宝安公路","共富新村","呼兰路","通河新村","共康路","彭浦新村","汶水路","上海马戏城","延长路","中山北路","上海火车站","汉中路","新闸路","人民广场","黄陂南路","陕西南路","常熟路","衡山路","徐家汇","上海体育馆","漕宝路","上海南站","锦江乐园","莲花路","外环路","莘庄"};
	public static String [] line2 = {"浦东国际机场","海天三路","远东大道","凌空路","川沙","华夏东路","创新中路","唐镇","广兰路","金科路","张江高科","龙阳路","世纪公园","上海科技馆","世纪大道","东昌路","陆家嘴","南京东路","人民广场","南京西路","静安寺","江苏路","中山公园","娄山关路","威宁路","北新泾","淞虹路","虹桥2号航站楼","虹桥火车站","徐泾东"};
	public static String [] line3 = {"上海南站","石龙路","龙漕路","漕溪路","宜山路","虹桥路","延安西路","中山公园","金沙江路","曹杨路","镇坪路","中潭路","上海火车站","宝山路","东宝兴路","虹口足球场","赤峰路","大柏树","江湾镇","殷高西路","长江南路","淞发路","张华浜","淞滨路","水产路","宝杨路","友谊路","铁力路","江杨北路"};
	public static String [] line4n = {"宜山路","虹桥路","延安西路","中山公园","金沙江路","曹杨路","镇坪路","中潭路","上海火车站","宝山路","海伦路","临平路","大连路","杨树浦路","浦东大道","世纪大道","浦电路(6号线)","蓝村路","塘桥","南浦大桥","西藏南路","鲁班路","大木桥路","东安路","上海体育场","上海体育馆"};
	public static String [] line4w  = {"宜山路","上海体育馆","上海体育场","东安路","大木桥路","鲁班路","西藏南路","南浦大桥","塘桥","蓝村路","浦电路(4号线)","世纪大道","浦东大道","杨树浦路","大连路","临平路","海伦路","宝山路","上海火车站","中潭路","镇坪路","曹杨路","金沙江路","中山公园","延安西路","虹桥路"};
	public static String [] line5 = {"莘庄","春申路","银都路","颛桥","北桥","剑川路","东川路","金平路","华宁路","文井路","闵行开发区"};
	public static String [] line6 = {"港城路","外高桥保税区北","航津路","外高桥保税区南","洲海路","五洲大道","东靖路","巨峰路","五莲路","博兴路","金桥路","云山路","德平路","北洋泾路","民生路","源深体育中心","世纪大道","浦电路(6号线)","蓝村路","上海儿童医学中心","临沂新村","高科西路","东明路","高青路","华夏西路","上南路","灵岩南路","东方体育中心"};
	public static String [] line7 = {"花木路","龙阳路","芳华路","锦绣路","杨高南路","高科西路","云台路","耀华路","长清路","后滩","船厂路","东安路","肇嘉浜路","常熟路","静安寺","昌平路","长寿路","镇坪路","岚皋路","新村路","大华三路","行知路","大场镇","场中路","上大路","南陈路","上海大学","顾村公园","刘行","潘广路","罗南新村","美兰湖"};
	public static String [] line8 = {"航天博物馆","联航路","江月路","浦江镇","芦恒路","凌兆新村","东方体育中心","杨思","成山路","耀华路","西藏南路","陆家浜路","老西门","大世界","人民广场","曲阜路","中兴路","西藏北路","虹口足球场","曲阳路","四平路","鞍山新村","江浦路","黄兴路","延吉中路","黄兴公园","翔殷路","嫩江路","市光路"};
	public static String [] line9 = {"杨高中路","世纪大道","商城路","小南门","陆家浜路","马当路","打浦桥","嘉善路","肇嘉浜路","徐家汇","宜山路","桂林路","漕河泾开发区","合川路","星中路","七宝","中春路","九亭","泗泾","佘山","洞泾","松江大学城","松江新城"};
	public static String [] line10z = {"新江湾城","殷高东路","三门路","江湾体育场","五角场","国权路","同济大学","四平路","邮电新村","海伦路","四川北路","天潼路","南京东路","豫园","老西门","新天地","陕西南路","上海图书馆","交通大学","虹桥路","宋园路","伊犁路","水城路","龙溪路","上海动物园","虹桥1号航站楼","虹桥2号航站楼","虹桥火车站"};
	public static String [] line10c = {"新江湾城","殷高东路","三门路","江湾体育场","五角场","国权路","同济大学","四平路","邮电新村","海伦路","四川北路","天潼路","南京东路","豫园","老西门","新天地","陕西南路","上海图书馆","交通大学","虹桥路","宋园路","伊犁路","水城路","龙溪路","龙柏新村","紫藤路","航中路"};
	public static String [] line11z = {"江苏路","隆德路","曹杨路","枫桥路","真如","上海西站","李子园","祁连山路","武威路","桃浦新村","南翔","马陆","嘉定新城","白银路","嘉定西","嘉定北"};
	public static String [] line11c = {"江苏路","隆德路","曹杨路","枫桥路","真如","上海西站","李子园","祁连山路","武威路","桃浦新村","南翔","马陆","嘉定新城","上海赛车场","昌吉东路","上海汽车城","安亭"};
	//	public static String [] linemt = {"龙阳路","浦东国际机场"};
	
/*	public static String [] checkLine1 = {"2号线","3号线","4号线外圈","4号线内圈","5号线","7号线","8号线","10号主线","10号支线"};
	public static String [] checkLine2 = {"7号线","6号线","4号线外圈","9号线","10号主线","10号支线","8号线","1号线","11号主线","3号线","4号线内圈",};
	public static String [] checkLine3 = {"8号线","4号线外圈","1号线","7号线","11号主线","2号线","10号主线"};
	public static String [] checkLine4w = {"10号主线","3号线","1号线","7号线","11号主线","2号线","8号线","6号线","9号线"};
	public static String [] checkLine4n = {"3号线","1号线","7号线","11号主线","2号线","10号主线","9号线"};
	public static String [] checkLine5 = {"1号线"};
	public static String [] checkLine6 = {"2号线","4号线外圈","9号线","7号线","8号线"};
	public static String [] checkLine7 = {"6号线","8号线","2号线","3号线","4号线内圈","1号线","10号主线"};
	public static String [] checkLine8 = {"3号线","10号主线","1号线","2号线","9号线","4号线外圈","6号线","7号线"};
	public static String [] checkLine9 = {"3号线","4号线外圈","1号线","7号线","8号线","2号线","6号线"};
	public static String [] checkLine10z = {"3号线","4号线内圈","1号线","8号线","2号线"};
	public static String [] checkLine10c = {"10号主线","2号线"};
	public static String [] checkLine11z = {"2号线","3号线","4号线外圈"};
	public static String [] checkLine11c = {"11号主线"};*/
	
	public static String  [][]lineStation = {line1, line2, line3,line4n,line4w,line5,line6,line7,line8,line9,line10z,line10c,line11z,line11c};
	//public static String [][] turnLine = {checkLine1,checkLine2,checkLine3,checkLine4w,checkLine4n,checkLine5,checkLine6,checkLine7,checkLine8,checkLine9,checkLine10z,checkLine10c,checkLine11z,checkLine11c};
    
 
}
